print("****************月份销售额****************")
print("日期、服装名称、价格/件、库存数量、销售量/每日")
print(" 1号       羽绒服        253.6        500             10 ")
print(" 2号       牛仔裤         86.3         600             60")
print(" 3号         风衣           96.8         335             43")
print(" 4号         皮草          135.9        885             63")
print(" 5号          T恤            65.8         632             63")
print(" 6号         衬衫           49.3         562            120")
print(" 7号       牛仔裤         86.3         600             72")
print(" 8号       羽绒服        253.6        500             69")
print(" 9号       牛仔裤         86.3         600             35")
print("10号      羽绒服        253.6       500            140")
print("11号      牛仔裤         86.3        600              90")
print("12号        皮草          135.9       885              24")
print("13号         T恤            65.8        632              45")
print("14号        风衣           96.8        335              25")
print("15号      牛仔裤         86.3        600              60")
print("16号         T恤            65.8        632            129")
print("17号      羽绒服        253.6       500              10 ")
print("18号        风衣           96.8        335              43")
print("19号         T恤            65.8        632              63")
print("20号      牛仔裤         86.3        600              60")
print("21号        皮草          135.9       885              63")
print("22号        风衣           96.8        335              60")
print("23号         T恤            65.8        632              58")
print("24号      牛仔裤         86.3        600             140")
print("25号         T恤            65.8        632              48")
print("26号        风衣           96.8        335              43")
print("27号        皮草          135.9       885              57")
print("28号      羽绒服        253.6       500              10")
print("29号         T恤            65.8        632              63")
print("30号        风衣           96.8        335              78")
num = (253.6*(10+69+140+10+10)+86.3*(60+72+35+90+60+60+140)+96.8*(43+25+43+60+43+78)+135.9*(63+24+63+57)+65.8*(63+45+129+63+58+48+63)+49.3*120) # 总销售额
print("总销售额：",num)
a = 10*3+24+25+35+43*3+48+57+58+60*4+63*5+69+72+78+90+120+129+140*2  # 月总销量
b = a/30   # 平均每日销量
print("平均每日销售数量：",b)
T恤 = (63+45+129+63+58+48+63)/a  # T恤销量占比
衬衫 = 1/a  # 衬衫销量占比
风衣 = (43+25+43+60+43+78)/a   # 风衣销量占比
牛仔裤 = (60+72+35+90+60+60+140)/a   # 牛仔裤销量占比
皮草 = (63+24+63+57)/a    # 皮草销量占比
羽绒服 = (10+69+140+10+10)/a  # 羽绒服销量占比
print("T恤月销售量占比：",round(T恤,4)*100,"%"," ")
print("衬衫月销售量占比：",round(衬衫,4) *100,"%"," ")
print("风衣月销售量占比：",round(风衣,4)*100,"%"," ")
print("牛仔裤月销售量占比：",round(牛仔裤,4)*100,"%"," ")
print("皮草月销售量占比：",round(皮草,4)*100,"%"," ")
print("羽绒服月销售量占比：",round(羽绒服,4)*100,"%"," ")